package com.intumit.solr.gis;

import java.net.URLEncoder;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.Collections;
import java.util.List;
import java.util.Set;
import java.util.TreeSet;

import org.apache.commons.httpclient.HttpClient;
import org.apache.commons.httpclient.methods.GetMethod;
import org.apache.commons.lang.StringUtils;

public class GisUtil {

	public GisUtil() {
	}

	public static void main(String args[]) {
		try {
			String address = "台北縣汐止市樟樹一路113號2樓";
			StringBuffer sb = new StringBuffer();
			sb.append("http://maps.google.com/maps/geo?q=");
			sb.append(URLEncoder.encode(address, "UTF-8"));
			sb
					.append("&output=csv&key='ABQIAAAA7eEH3GBDKpYy8tMUF608SxRAqgD3ee5DBm5t2ULa9goFAiTGpxTw_RZLZ_7hl2BrkYNn0trervml1w'");
			HttpClient client = new HttpClient();
			GetMethod g = new GetMethod(sb.toString());
			client.executeMethod(g);
			String s = g.getResponseBodyAsString();
			System.out.println(s);
			String results[] = s.split(",");
			System.out.println(results[0]);
		} catch (Exception e) {
			e.printStackTrace();
		}
	}

	public List sugguest(String address) {
		String addr = StringUtils.stripToEmpty(address);
		if (addr.length() > 6 || addr.length() == 0)
			return Collections.EMPTY_LIST;
		List l = new ArrayList();
		String as[];
		int j = (as = CITIES_AREAS_COUPLES).length;
		for (int i = 0; i < j; i++) {
			String s = as[i];
			if (s.contains(address))
				l.add(s);
		}

		return l;
	}

	public boolean matcheArea(String address) {
		String addr = StringUtils.stripToEmpty(address);
		if (addr.length() > 3)
			return false;
		else
			return areaSet.contains(addr);
	}

	public boolean matcheCity(String address) {
		String addr = StringUtils.stripToEmpty(address);
		if (addr.length() > 3)
			return false;
		else
			return citySet.contains(addr);
	}

	public String cityFromAddr(String address) {
		String addr = StringUtils.stripToEmpty(address);
		for (String city : CITIES) {
			if (addr.contains(city))
				return city;
		}
		return null;
	}

	public String areaFromAddr(String address) {
		String addr = StringUtils.stripToEmpty(address);
		for (String cityArea : AREAS) {
			if (addr.contains(cityArea))
				return cityArea;
		}
		return null;
	}

	public String cityAreaFromAddr(String address) {
		String addr = StringUtils.stripToEmpty(address);
		for (String cityArea : CITIES_THEN_AREAS) {
			if (addr.contains(cityArea))
				return cityArea;
		}
		return null;
	}

	public boolean matcheCityThenArea(String address) {
		String addr = StringUtils.stripToEmpty(address);
		if (addr.length() > 6)
			return false;
		else
			return cityAreaSet.contains(addr);
	}

	public double[] gpsRange(double 經度, double 緯度, double 範圍) {
		double strs[] = new double[4];

		double 差距 = 範圍 / 100.0;

		strs[0] = 經度 + 差距;
		strs[1] = 緯度 + 差距;
		strs[2] = 經度 - 差距;
		strs[3] = 緯度 - 差距;

		return strs;
	}

	public String describeGeoScale(int scale) {
		if (scale == 0)
			return "未知";
		if (scale == 1)
			return "國家";
		if (scale == 2)
			return "省,直轄市";
		if (scale == 3)
			return "縣市";
		if (scale == 4)
			return "鄉鎮市";
		if (scale == 5)
			return "郵遞區號";
		if (scale == 6)
			return "街道";
		if (scale == 7)
			return "路口";
		if (scale == 8)
			return "地址";
		if (scale == 9)
			return "地標";
		return "";
	}

	public static class GScaleLatLng {
		public double scale, lat, lng;
	}

	public GScaleLatLng geo(String address) {
		try {
			if (client == null)
				client = new HttpClient();
			StringBuffer sb = new StringBuffer();
			sb.append("http://maps.google.com/maps/geo?q=");
			sb.append(URLEncoder.encode(address, "UTF-8"));
			sb
					.append("&output=csv&key="
							+ "'ABQIAAAA7eEH3GBDKpYy8tMUF608SxRAqgD3ee5DBm5t2ULa9goFAiTGpxTw_RZLZ_7hl2BrkYNn0trervml1w'");

			GetMethod g = new GetMethod(sb.toString());
			client.executeMethod(g);
			String s = g.getResponseBodyAsString();
			System.out.println(s);
			String[] ss = s.split(",");
			if ("200".equals(ss[0])) {
				GScaleLatLng gsll = new GScaleLatLng();
				gsll.scale = Double.valueOf(ss[1]);
				gsll.lat = Double.valueOf(ss[2]);
				gsll.lng = Double.valueOf(ss[3]);
				// if (lat > 26.0 || lat < 21.0 || lng > 123 || lng < 118) {
				// System.out.println("out of range");
				// return null;
				// }
				return gsll;
			} else {
				System.out.println("not an address");
				return null;
			}
		} catch (Exception e) {
			e.printStackTrace();
			return null;
		}
	}

	public static String[] AREAS = new String[] { "士林區", "左營區", "北區", "大里市",
			"北屯區", "大安區", "松山區", "土城市", "淡水鎮", "桃園市", "新興區", "三民區", "鳳山市",
			"永康市", "北投區", "東區", "中山區", "中壢市", "內湖區", "三重市", "樹林市", "中埔鄉",
			"信義區", "冬山鄉", "大同區", "芎林鄉", "文山區", "平鎮市", "前鎮區", "新莊市", "中和市",
			"苓雅區", "七股鄉", "小港區", "安南區", "中西區", "楠梓區", "水上鄉", "三峽鎮", "太平市",
			"西區", "板橋市", "梓官鄉", "中正區", "南區", "永和市", "蘆竹鄉", "深坑鄉", "潭子鄉", "蘆洲市",
			"新店市", "鹽埕區", "岡山鎮", "草屯鎮", "仁德鄉", "鶯歌鎮", "前金區", "橋頭鄉", "南港區",
			"佳里鎮", "彰化市", "大園鄉", "頭份鎮", "歸仁鄉", "埔里鎮", "汐止市", "大溪鎮", "泰山鄉",
			"內埔鄉", "鳥松鄉", "西屯區", "梧棲鎮", "大社鄉", "大林鎮", "大寮鄉", "八德市", "后里鄉",
			"鼓山區", "關廟鄉", "宜蘭市", "烏日鄉", "萬華區", "南屯區", "三芝鄉", "八里鄉", "龜山鄉",
			"中區", "萬巒鄉", "高樹鄉", "新屋鄉", "竹北市", "中寮鄉", "員林鎮", "路竹鄉", "名間鄉",
			"麻豆鎮", "番路鄉", "阿蓮鄉", "湖內鄉", "馬公市", "員山鄉", "屏東市", "斗六市", "萬里鄉",
			"朴子市", "大肚鄉", "豐原市", "大樹鄉", "霧峰鄉", "花蓮市", "龍潭鄉", "白河鎮", "頭城鎮",
			"苗栗市", "梅山鄉", "埤頭鄉", "安平區", "壽豐鄉", "太保市", "白沙鄉", "三星鄉", "新化鎮",
			"林口鄉", "羅東鎮", "台東市", "潮州鎮", "綠島鄉", "學甲鎮", "五結鄉", "外埔鄉", "仁武鄉",
			"安樂區", "暖暖區", "民雄鄉", "官田鄉", "將軍鄉", "新市鄉", "吉安鄉", "南投市", "楠西鄉",
			"長治鄉", "壯圍鄉", "太麻里", "斗南鎮", "大村鄉", "北埔鄉", "沙鹿鎮", "虎尾鎮", "湖口鄉",
			"龍崎鄉", "新埔鎮", "楊梅鎮", "集集鎮", "觀音鄉", "關西鎮", "寶山鄉", "旗山鎮", "社頭鄉",
			"竹南鎮", "美濃鎮", "仁愛鄉", "杉林鄉", "九如鄉", "清水鎮", "烏來鄉", "三灣鄉", "蘇澳鎮",
			"七堵區", "土庫鎮", "玉井鄉", "大內鄉", "西港鄉", "國姓鄉", "茄萣鄉", "坪林鄉", "石門鄉",
			"龍井鄉", "礁溪鄉", "仁愛區", "和美鎮", "六龜鄉", "大雅鄉", "新豐鄉", "六甲鄉", "二崙鄉",
			"新營市", "莿桐鄉", "安定鄉", "秀林鄉", "溪口鄉", "鹿草鄉", "恆春鎮", "田尾鄉", "埔心鄉",
			"永靖鄉", "造橋鄉", "竹田鄉", "湖西鄉", "鹽埔鄉", "下營鄉", "柳營鄉", "燕巢鄉", "後龍鎮",
			"東港鎮", "卑南鄉", "崙背鄉", "西螺鎮", "里港鄉", "銅鑼鄉", "苑裡鎮", "西湖鄉", "神岡鄉",
			"林內鄉", "西嶼鄉", "豐濱鄉", "竹東鎮", "新社鄉", "林園鄉", "東山鄉", "秀水鄉", "南庄鄉",
			"竹崎鄉", "大同鄉", "旗津區", "大埤鄉", "古坑鄉", "萬丹鄉", "東勢鎮", "枋山鄉", "溪湖鎮",
			"埔鹽鄉", "二林鎮", "新港鄉", "永安鄉", "石岡鄉", "芬園鄉", "大湖鄉", "溪州鄉", "元長鄉",
			"花壇鄉", "山上鄉", "福興鄉", "烈嶼鄉", "三義鄉", "魚池鄉", "金山鄉", "新園鄉", "鹿港鎮",
			"後壁鄉", "枋寮鄉", "玉里鎮", "卓蘭鎮", "瑞穗鄉", "南化鄉", "彌陀鄉", "水里鄉", "瑞芳鎮",
			"大甲鎮", "五股鄉", "東石鄉", "新城鄉", "峨眉鄉", "光復鄉", "石碇鄉", "田寮鄉", "北港鎮",
			"公館鄉", "新埤鄉", "南州鄉", "長濱鄉", "布袋鎮", "成功鎮", "橫山鄉", "竹山鎮", "鹽水鎮",
			"東河鄉", "台西鄉", "牡丹鄉", "復興鄉", "大武鄉", "獅子鄉", "褒忠鄉", "東勢鄉", "線西鄉",
			"鳳林鎮", "頭屋鄉", "崁頂鄉", "六腳鄉", "伸港鄉", "麟洛鄉", "車城鄉", "莒光鄉", "田中鎮",
			"通霄鎮", "北斗鎮", "獅潭鄉", "金寧鄉", "北竿鄉", "麥寮鄉", "大安鄉", "鹿野鄉", "甲仙鄉",
			"富里鄉" };

	public static String[] CITIES = new String[] { "台北市", "高雄市", "台中市", "台中縣",
			"台北縣", "桃園縣", "高雄縣", "台南縣", "嘉義市", "台南市", "嘉義縣", "宜蘭縣", "新竹縣",
			"南投縣", "彰化縣", "苗栗縣", "屏東縣", "基隆市", "新竹市", "澎湖縣", "雲林縣", "花蓮縣",
			"台東縣", "金門縣", "連江縣" };

	public static String[] CITIES_THEN_AREAS = new String[] { "南投縣中寮鄉",
			"南投縣仁愛鄉", "南投縣南投市", "南投縣名間鄉", "南投縣國姓鄉", "南投縣埔里鎮", "南投縣水里鄉",
			"南投縣竹山鎮", "南投縣草屯鎮", "南投縣集集鎮", "南投縣魚池鄉", "台中市中區", "台中市北區", "台中市北屯區",
			"台中市南區", "台中市南屯區", "台中市東區", "台中市西區", "台中市西屯區", "台中縣后里鄉", "台中縣外埔鄉",
			"台中縣大安鄉", "台中縣大甲鎮", "台中縣大肚鄉", "台中縣大里市", "台中縣大雅鄉", "台中縣太平市",
			"台中縣新社鄉", "台中縣東勢鎮", "台中縣梧棲鎮", "台中縣沙鹿鎮", "台中縣清水鎮", "台中縣潭子鄉",
			"台中縣烏日鄉", "台中縣石岡鄉", "台中縣神岡鄉", "台中縣豐原市", "台中縣霧峰鄉", "台中縣龍井鄉",
			"台北市中山區", "台北市中正區", "台北市信義區", "台北市內湖區", "台北市北投區", "台北市南港區",
			"台北市士林區", "台北市大同區", "台北市大安區", "台北市文山區", "台北市松山區", "台北市萬華區",
			"台北縣三峽鎮", "台北縣三芝鄉", "台北縣三重市", "台北縣中和市", "台北縣五股鄉", "台北縣八里鄉",
			"台北縣土城市", "台北縣坪林鄉", "台北縣新店市", "台北縣新莊市", "台北縣板橋市", "台北縣林口鄉",
			"台北縣樹林市", "台北縣永和市", "台北縣汐止市", "台北縣泰山鄉", "台北縣淡水鎮", "台北縣深坑鄉",
			"台北縣烏來鄉", "台北縣瑞芳鎮", "台北縣石碇鄉", "台北縣石門鄉", "台北縣萬里鄉", "台北縣蘆洲市",
			"台北縣金山鄉", "台北縣鶯歌鎮", "台南市中西區", "台南市北區", "台南市南區", "台南市安南區", "台南市安平區",
			"台南市東區", "台南縣七股鄉", "台南縣下營鄉", "台南縣仁德鄉", "台南縣佳里鎮", "台南縣六甲鄉",
			"台南縣南化鄉", "台南縣大內鄉", "台南縣學甲鎮", "台南縣安定鄉", "台南縣官田鄉", "台南縣將軍鄉",
			"台南縣山上鄉", "台南縣後壁鄉", "台南縣新化鎮", "台南縣新市鄉", "台南縣新營市", "台南縣東山鄉",
			"台南縣柳營鄉", "台南縣楠西鄉", "台南縣歸仁鄉", "台南縣永康市", "台南縣玉井鄉", "台南縣白河鎮",
			"台南縣西港鄉", "台南縣關廟鄉", "台南縣鹽水鎮", "台南縣麻豆鎮", "台南縣龍崎鄉", "台東縣卑南鄉",
			"台東縣台東市", "台東縣大武鄉", "台東縣太麻里", "台東縣成功鎮", "台東縣東河鄉", "台東縣綠島鄉",
			"台東縣長濱鄉", "台東縣鹿野鄉", "嘉義縣中埔鄉", "嘉義縣六腳鄉", "嘉義縣大林鎮", "嘉義縣太保市",
			"嘉義縣布袋鎮", "嘉義縣新港鄉", "嘉義縣朴子市", "嘉義縣東石鄉", "嘉義縣梅山鄉", "嘉義縣民雄鄉",
			"嘉義縣水上鄉", "嘉義縣溪口鄉", "嘉義縣番路鄉", "嘉義縣竹崎鄉", "嘉義縣鹿草鄉", "基隆市七堵區",
			"基隆市中山區", "基隆市中正區", "基隆市仁愛區", "基隆市信義區", "基隆市安樂區", "基隆市暖暖區",
			"宜蘭縣三星鄉", "宜蘭縣五結鄉", "宜蘭縣冬山鄉", "宜蘭縣員山鄉", "宜蘭縣壯圍鄉", "宜蘭縣大同鄉",
			"宜蘭縣宜蘭市", "宜蘭縣礁溪鄉", "宜蘭縣羅東鎮", "宜蘭縣蘇澳鎮", "宜蘭縣頭城鎮", "屏東縣九如鄉",
			"屏東縣內埔鄉", "屏東縣南州鄉", "屏東縣屏東市", "屏東縣崁頂鄉", "屏東縣恆春鎮", "屏東縣新園鄉",
			"屏東縣新埤鄉", "屏東縣東港鎮", "屏東縣枋寮鄉", "屏東縣枋山鄉", "屏東縣潮州鎮", "屏東縣牡丹鄉",
			"屏東縣獅子鄉", "屏東縣竹田鄉", "屏東縣萬丹鄉", "屏東縣萬巒鄉", "屏東縣車城鄉", "屏東縣里港鄉",
			"屏東縣長治鄉", "屏東縣高樹鄉", "屏東縣鹽埔鄉", "屏東縣麟洛鄉", "彰化縣二林鎮", "彰化縣伸港鄉",
			"彰化縣北斗鎮", "彰化縣和美鎮", "彰化縣員林鎮", "彰化縣埔心鄉", "彰化縣埔鹽鄉", "彰化縣埤頭鄉",
			"彰化縣大村鄉", "彰化縣彰化市", "彰化縣永靖鄉", "彰化縣溪州鄉", "彰化縣溪湖鎮", "彰化縣田中鎮",
			"彰化縣田尾鄉", "彰化縣社頭鄉", "彰化縣福興鄉", "彰化縣秀水鄉", "彰化縣線西鄉", "彰化縣芬園鄉",
			"彰化縣花壇鄉", "彰化縣鹿港鎮", "新竹縣北埔鄉", "新竹縣寶山鄉", "新竹縣峨眉鄉", "新竹縣新埔鎮",
			"新竹縣新豐鄉", "新竹縣橫山鄉", "新竹縣湖口鄉", "新竹縣竹北市", "新竹縣竹東鎮", "新竹縣芎林鄉",
			"新竹縣關西鎮", "桃園縣中壢市", "桃園縣八德市", "桃園縣大園鄉", "桃園縣大溪鎮", "桃園縣平鎮市",
			"桃園縣復興鄉", "桃園縣新屋鄉", "桃園縣桃園市", "桃園縣楊梅鎮", "桃園縣蘆竹鄉", "桃園縣觀音鄉",
			"桃園縣龍潭鄉", "桃園縣龜山鄉", "澎湖縣湖西鄉", "澎湖縣白沙鄉", "澎湖縣西嶼鄉", "澎湖縣馬公市",
			"花蓮縣光復鄉", "花蓮縣吉安鄉", "花蓮縣壽豐鄉", "花蓮縣富里鄉", "花蓮縣新城鄉", "花蓮縣玉里鎮",
			"花蓮縣瑞穗鄉", "花蓮縣秀林鄉", "花蓮縣花蓮市", "花蓮縣豐濱鄉", "花蓮縣鳳林鎮", "苗栗縣三灣鄉",
			"苗栗縣三義鄉", "苗栗縣公館鄉", "苗栗縣卓蘭鎮", "苗栗縣南庄鄉", "苗栗縣大湖鄉", "苗栗縣後龍鎮",
			"苗栗縣獅潭鄉", "苗栗縣竹南鎮", "苗栗縣苑裡鎮", "苗栗縣苗栗市", "苗栗縣西湖鄉", "苗栗縣通霄鎮",
			"苗栗縣造橋鄉", "苗栗縣銅鑼鄉", "苗栗縣頭份鎮", "苗栗縣頭屋鄉", "連江縣北竿鄉", "連江縣莒光鄉",
			"金門縣烈嶼鄉", "金門縣金寧鄉", "雲林縣二崙鄉", "雲林縣元長鄉", "雲林縣北港鎮", "雲林縣古坑鄉",
			"雲林縣台西鄉", "雲林縣土庫鎮", "雲林縣大埤鄉", "雲林縣崙背鄉", "雲林縣斗六市", "雲林縣斗南鎮",
			"雲林縣東勢鄉", "雲林縣林內鄉", "雲林縣莿桐鄉", "雲林縣虎尾鎮", "雲林縣褒忠鄉", "雲林縣西螺鎮",
			"雲林縣麥寮鄉", "高雄市三民區", "高雄市前金區", "高雄市前鎮區", "高雄市小港區", "高雄市左營區",
			"高雄市新興區", "高雄市旗津區", "高雄市楠梓區", "高雄市苓雅區", "高雄市鹽埕區", "高雄市鼓山區",
			"高雄縣仁武鄉", "高雄縣六龜鄉", "高雄縣大寮鄉", "高雄縣大樹鄉", "高雄縣大社鄉", "高雄縣岡山鎮",
			"高雄縣彌陀鄉", "高雄縣旗山鎮", "高雄縣杉林鄉", "高雄縣林園鄉", "高雄縣梓官鄉", "高雄縣橋頭鄉",
			"高雄縣永安鄉", "高雄縣湖內鄉", "高雄縣燕巢鄉", "高雄縣田寮鄉", "高雄縣甲仙鄉", "高雄縣美濃鎮",
			"高雄縣茄萣鄉", "高雄縣路竹鄉", "高雄縣阿蓮鄉", "高雄縣鳥松鄉", "高雄縣鳳山市" };

	public static String[] CITIES_AREAS_COUPLES = new String[] { "台北市", "高雄市",
			"台中市", "台中縣", "台北縣", "桃園縣", "高雄縣", "台南縣", "嘉義市", "台南市", "嘉義縣",
			"宜蘭縣", "新竹縣", "南投縣", "彰化縣", "苗栗縣", "屏東縣", "基隆市", "新竹市", "澎湖縣",
			"雲林縣", "花蓮縣", "台東縣", "金門縣", "連江縣", "士林區", "左營區", "北區", "大里市",
			"北屯區", "大安區", "松山區", "土城市", "淡水鎮", "桃園市", "新興區", "三民區", "鳳山市",
			"永康市", "北投區", "東區", "中山區", "中壢市", "內湖區", "三重市", "樹林市", "中埔鄉",
			"信義區", "冬山鄉", "大同區", "芎林鄉", "文山區", "平鎮市", "前鎮區", "新莊市", "中和市",
			"苓雅區", "七股鄉", "小港區", "安南區", "中西區", "楠梓區", "水上鄉", "三峽鎮", "太平市",
			"西區", "板橋市", "梓官鄉", "中正區", "南區", "永和市", "蘆竹鄉", "深坑鄉", "潭子鄉", "蘆洲市",
			"新店市", "鹽埕區", "岡山鎮", "草屯鎮", "仁德鄉", "鶯歌鎮", "前金區", "橋頭鄉", "南港區",
			"佳里鎮", "彰化市", "大園鄉", "頭份鎮", "歸仁鄉", "埔里鎮", "汐止市", "大溪鎮", "泰山鄉",
			"內埔鄉", "鳥松鄉", "西屯區", "梧棲鎮", "大社鄉", "大林鎮", "大寮鄉", "八德市", "后里鄉",
			"鼓山區", "關廟鄉", "宜蘭市", "烏日鄉", "萬華區", "南屯區", "三芝鄉", "八里鄉", "龜山鄉",
			"中區", "萬巒鄉", "高樹鄉", "新屋鄉", "竹北市", "中寮鄉", "員林鎮", "路竹鄉", "名間鄉",
			"麻豆鎮", "番路鄉", "阿蓮鄉", "湖內鄉", "馬公市", "員山鄉", "屏東市", "斗六市", "萬里鄉",
			"朴子市", "大肚鄉", "豐原市", "大樹鄉", "霧峰鄉", "花蓮市", "龍潭鄉", "白河鎮", "頭城鎮",
			"苗栗市", "梅山鄉", "埤頭鄉", "安平區", "壽豐鄉", "太保市", "白沙鄉", "三星鄉", "新化鎮",
			"林口鄉", "羅東鎮", "台東市", "潮州鎮", "綠島鄉", "學甲鎮", "五結鄉", "外埔鄉", "仁武鄉",
			"安樂區", "暖暖區", "民雄鄉", "官田鄉", "將軍鄉", "新市鄉", "吉安鄉", "南投市", "楠西鄉",
			"長治鄉", "壯圍鄉", "太麻里", "斗南鎮", "大村鄉", "北埔鄉", "沙鹿鎮", "虎尾鎮", "湖口鄉",
			"龍崎鄉", "新埔鎮", "楊梅鎮", "集集鎮", "觀音鄉", "關西鎮", "寶山鄉", "旗山鎮", "社頭鄉",
			"竹南鎮", "美濃鎮", "仁愛鄉", "杉林鄉", "九如鄉", "清水鎮", "烏來鄉", "三灣鄉", "蘇澳鎮",
			"七堵區", "土庫鎮", "玉井鄉", "大內鄉", "西港鄉", "國姓鄉", "茄萣鄉", "坪林鄉", "石門鄉",
			"龍井鄉", "礁溪鄉", "仁愛區", "和美鎮", "六龜鄉", "大雅鄉", "新豐鄉", "六甲鄉", "二崙鄉",
			"新營市", "莿桐鄉", "安定鄉", "秀林鄉", "溪口鄉", "鹿草鄉", "恆春鎮", "田尾鄉", "埔心鄉",
			"永靖鄉", "造橋鄉", "竹田鄉", "湖西鄉", "鹽埔鄉", "下營鄉", "柳營鄉", "燕巢鄉", "後龍鎮",
			"東港鎮", "卑南鄉", "崙背鄉", "西螺鎮", "里港鄉", "銅鑼鄉", "苑裡鎮", "西湖鄉", "神岡鄉",
			"林內鄉", "西嶼鄉", "豐濱鄉", "竹東鎮", "新社鄉", "林園鄉", "東山鄉", "秀水鄉", "南庄鄉",
			"竹崎鄉", "大同鄉", "旗津區", "大埤鄉", "古坑鄉", "萬丹鄉", "東勢鎮", "枋山鄉", "溪湖鎮",
			"埔鹽鄉", "二林鎮", "新港鄉", "永安鄉", "石岡鄉", "芬園鄉", "大湖鄉", "溪州鄉", "元長鄉",
			"花壇鄉", "山上鄉", "福興鄉", "烈嶼鄉", "三義鄉", "魚池鄉", "金山鄉", "新園鄉", "鹿港鎮",
			"後壁鄉", "枋寮鄉", "玉里鎮", "卓蘭鎮", "瑞穗鄉", "南化鄉", "彌陀鄉", "水里鄉", "瑞芳鎮",
			"大甲鎮", "五股鄉", "東石鄉", "新城鄉", "峨眉鄉", "光復鄉", "石碇鄉", "田寮鄉", "北港鎮",
			"公館鄉", "新埤鄉", "南州鄉", "長濱鄉", "布袋鎮", "成功鎮", "橫山鄉", "竹山鎮", "鹽水鎮",
			"東河鄉", "台西鄉", "牡丹鄉", "復興鄉", "大武鄉", "獅子鄉", "褒忠鄉", "東勢鄉", "線西鄉",
			"鳳林鎮", "頭屋鄉", "崁頂鄉", "六腳鄉", "伸港鄉", "麟洛鄉", "車城鄉", "莒光鄉", "田中鎮",
			"通霄鎮", "北斗鎮", "獅潭鄉", "金寧鄉", "北竿鄉", "麥寮鄉", "大安鄉", "鹿野鄉", "甲仙鄉",
			"富里鄉", "南投縣中寮鄉", "南投縣仁愛鄉", "南投縣南投市", "南投縣名間鄉", "南投縣國姓鄉", "南投縣埔里鎮",
			"南投縣水里鄉", "南投縣竹山鎮", "南投縣草屯鎮", "南投縣集集鎮", "南投縣魚池鄉", "台中市中區", "台中市北區",
			"台中市北屯區", "台中市南區", "台中市南屯區", "台中市東區", "台中市西區", "台中市西屯區", "台中縣后里鄉",
			"台中縣外埔鄉", "台中縣大安鄉", "台中縣大甲鎮", "台中縣大肚鄉", "台中縣大里市", "台中縣大雅鄉",
			"台中縣太平市", "台中縣新社鄉", "台中縣東勢鎮", "台中縣梧棲鎮", "台中縣沙鹿鎮", "台中縣清水鎮",
			"台中縣潭子鄉", "台中縣烏日鄉", "台中縣石岡鄉", "台中縣神岡鄉", "台中縣豐原市", "台中縣霧峰鄉",
			"台中縣龍井鄉", "台北市中山區", "台北市中正區", "台北市信義區", "台北市內湖區", "台北市北投區",
			"台北市南港區", "台北市士林區", "台北市大同區", "台北市大安區", "台北市文山區", "台北市松山區",
			"台北市萬華區", "台北縣三峽鎮", "台北縣三芝鄉", "台北縣三重市", "台北縣中和市", "台北縣五股鄉",
			"台北縣八里鄉", "台北縣土城市", "台北縣坪林鄉", "台北縣新店市", "台北縣新莊市", "台北縣板橋市",
			"台北縣林口鄉", "台北縣樹林市", "台北縣永和市", "台北縣汐止市", "台北縣泰山鄉", "台北縣淡水鎮",
			"台北縣深坑鄉", "台北縣烏來鄉", "台北縣瑞芳鎮", "台北縣石碇鄉", "台北縣石門鄉", "台北縣萬里鄉",
			"台北縣蘆洲市", "台北縣金山鄉", "台北縣鶯歌鎮", "台南市中西區", "台南市北區", "台南市南區", "台南市安南區",
			"台南市安平區", "台南市東區", "台南縣七股鄉", "台南縣下營鄉", "台南縣仁德鄉", "台南縣佳里鎮",
			"台南縣六甲鄉", "台南縣南化鄉", "台南縣大內鄉", "台南縣學甲鎮", "台南縣安定鄉", "台南縣官田鄉",
			"台南縣將軍鄉", "台南縣山上鄉", "台南縣後壁鄉", "台南縣新化鎮", "台南縣新市鄉", "台南縣新營市",
			"台南縣東山鄉", "台南縣柳營鄉", "台南縣楠西鄉", "台南縣歸仁鄉", "台南縣永康市", "台南縣玉井鄉",
			"台南縣白河鎮", "台南縣西港鄉", "台南縣關廟鄉", "台南縣鹽水鎮", "台南縣麻豆鎮", "台南縣龍崎鄉",
			"台東縣卑南鄉", "台東縣台東市", "台東縣大武鄉", "台東縣太麻里", "台東縣成功鎮", "台東縣東河鄉",
			"台東縣綠島鄉", "台東縣長濱鄉", "台東縣鹿野鄉", "嘉義縣中埔鄉", "嘉義縣六腳鄉", "嘉義縣大林鎮",
			"嘉義縣太保市", "嘉義縣布袋鎮", "嘉義縣新港鄉", "嘉義縣朴子市", "嘉義縣東石鄉", "嘉義縣梅山鄉",
			"嘉義縣民雄鄉", "嘉義縣水上鄉", "嘉義縣溪口鄉", "嘉義縣番路鄉", "嘉義縣竹崎鄉", "嘉義縣鹿草鄉",
			"基隆市七堵區", "基隆市中山區", "基隆市中正區", "基隆市仁愛區", "基隆市信義區", "基隆市安樂區",
			"基隆市暖暖區", "宜蘭縣三星鄉", "宜蘭縣五結鄉", "宜蘭縣冬山鄉", "宜蘭縣員山鄉", "宜蘭縣壯圍鄉",
			"宜蘭縣大同鄉", "宜蘭縣宜蘭市", "宜蘭縣礁溪鄉", "宜蘭縣羅東鎮", "宜蘭縣蘇澳鎮", "宜蘭縣頭城鎮",
			"屏東縣九如鄉", "屏東縣內埔鄉", "屏東縣南州鄉", "屏東縣屏東市", "屏東縣崁頂鄉", "屏東縣恆春鎮",
			"屏東縣新園鄉", "屏東縣新埤鄉", "屏東縣東港鎮", "屏東縣枋寮鄉", "屏東縣枋山鄉", "屏東縣潮州鎮",
			"屏東縣牡丹鄉", "屏東縣獅子鄉", "屏東縣竹田鄉", "屏東縣萬丹鄉", "屏東縣萬巒鄉", "屏東縣車城鄉",
			"屏東縣里港鄉", "屏東縣長治鄉", "屏東縣高樹鄉", "屏東縣鹽埔鄉", "屏東縣麟洛鄉", "彰化縣二林鎮",
			"彰化縣伸港鄉", "彰化縣北斗鎮", "彰化縣和美鎮", "彰化縣員林鎮", "彰化縣埔心鄉", "彰化縣埔鹽鄉",
			"彰化縣埤頭鄉", "彰化縣大村鄉", "彰化縣彰化市", "彰化縣永靖鄉", "彰化縣溪州鄉", "彰化縣溪湖鎮",
			"彰化縣田中鎮", "彰化縣田尾鄉", "彰化縣社頭鄉", "彰化縣福興鄉", "彰化縣秀水鄉", "彰化縣線西鄉",
			"彰化縣芬園鄉", "彰化縣花壇鄉", "彰化縣鹿港鎮", "新竹縣北埔鄉", "新竹縣寶山鄉", "新竹縣峨眉鄉",
			"新竹縣新埔鎮", "新竹縣新豐鄉", "新竹縣橫山鄉", "新竹縣湖口鄉", "新竹縣竹北市", "新竹縣竹東鎮",
			"新竹縣芎林鄉", "新竹縣關西鎮", "桃園縣中壢市", "桃園縣八德市", "桃園縣大園鄉", "桃園縣大溪鎮",
			"桃園縣平鎮市", "桃園縣復興鄉", "桃園縣新屋鄉", "桃園縣桃園市", "桃園縣楊梅鎮", "桃園縣蘆竹鄉",
			"桃園縣觀音鄉", "桃園縣龍潭鄉", "桃園縣龜山鄉", "澎湖縣湖西鄉", "澎湖縣白沙鄉", "澎湖縣西嶼鄉",
			"澎湖縣馬公市", "花蓮縣光復鄉", "花蓮縣吉安鄉", "花蓮縣壽豐鄉", "花蓮縣富里鄉", "花蓮縣新城鄉",
			"花蓮縣玉里鎮", "花蓮縣瑞穗鄉", "花蓮縣秀林鄉", "花蓮縣花蓮市", "花蓮縣豐濱鄉", "花蓮縣鳳林鎮",
			"苗栗縣三灣鄉", "苗栗縣三義鄉", "苗栗縣公館鄉", "苗栗縣卓蘭鎮", "苗栗縣南庄鄉", "苗栗縣大湖鄉",
			"苗栗縣後龍鎮", "苗栗縣獅潭鄉", "苗栗縣竹南鎮", "苗栗縣苑裡鎮", "苗栗縣苗栗市", "苗栗縣西湖鄉",
			"苗栗縣通霄鎮", "苗栗縣造橋鄉", "苗栗縣銅鑼鄉", "苗栗縣頭份鎮", "苗栗縣頭屋鄉", "連江縣北竿鄉",
			"連江縣莒光鄉", "金門縣烈嶼鄉", "金門縣金寧鄉", "雲林縣二崙鄉", "雲林縣元長鄉", "雲林縣北港鎮",
			"雲林縣古坑鄉", "雲林縣台西鄉", "雲林縣土庫鎮", "雲林縣大埤鄉", "雲林縣崙背鄉", "雲林縣斗六市",
			"雲林縣斗南鎮", "雲林縣東勢鄉", "雲林縣林內鄉", "雲林縣莿桐鄉", "雲林縣虎尾鎮", "雲林縣褒忠鄉",
			"雲林縣西螺鎮", "雲林縣麥寮鄉", "高雄市三民區", "高雄市前金區", "高雄市前鎮區", "高雄市小港區",
			"高雄市左營區", "高雄市新興區", "高雄市旗津區", "高雄市楠梓區", "高雄市苓雅區", "高雄市鹽埕區",
			"高雄市鼓山區", "高雄縣仁武鄉", "高雄縣六龜鄉", "高雄縣大寮鄉", "高雄縣大樹鄉", "高雄縣大社鄉",
			"高雄縣岡山鎮", "高雄縣彌陀鄉", "高雄縣旗山鎮", "高雄縣杉林鄉", "高雄縣林園鄉", "高雄縣梓官鄉",
			"高雄縣橋頭鄉", "高雄縣永安鄉", "高雄縣湖內鄉", "高雄縣燕巢鄉", "高雄縣田寮鄉", "高雄縣甲仙鄉",
			"高雄縣美濃鎮", "高雄縣茄萣鄉", "高雄縣路竹鄉", "高雄縣阿蓮鄉", "高雄縣鳥松鄉", "高雄縣鳳山市" };
	private static Set<String> areaSet = new TreeSet<String>(Arrays
			.asList(AREAS));
	private static Set<String> citySet = new TreeSet<String>(Arrays
			.asList(CITIES));
	private static Set<String> cityAreaSet = new TreeSet<String>(Arrays
			.asList(CITIES_THEN_AREAS));
	private HttpClient client;

}
